Revit 2023 API
Definition.ParameterGroup Property
 Returns the group ID of the parameter definition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public abstract BuiltInParameterGroup ParameterGroup { get; }
Visual Basic
Public MustOverride ReadOnly Property ParameterGroup As BuiltInParameterGroup
	Get
Visual C++
public:
virtual property BuiltInParameterGroup ParameterGroup {
	BuiltInParameterGroup get () abstract;
}
See Also
Definition Class
Autodesk.Revit.DB Namespace